{
    "change": {
        "keywords": [
            "change",
            "update",
            "correct",
            "mistake"
        ],
        "action": "Do you want to correct your last answer?",
        "fallback": "Please respond with yes or no if you wish to revise your most recent statement."
    },
    "capabilities": {
        "keywords": [
            "capabi",
            "ability",
            "you do",
            "use"
        ],
        "action": "I will provide you with some information about microcontrollers. Please answer the questions to receive the best feedback on which microcontroller suits you best.",
        "fallback": "You've already learned what I'm capable of. Now, let's begin the test!"
    },
    "start": {
        "keywords": [
            "restart",
            "start over",
            "redo",
            "begin",
            "lets",
            "let's",
            "let"
        ],
        "action": "Hello, you're about to begin or restart your personal microcontroller test. Please confirm and follow the questions to ensure a smooth and convenient process."
    },
    "exit": {
        "keywords": [
            "exit",
            "stop",
            "end",
            "no more",
            "finish",
            "result"
        ],
        "action": "You're about to leave this session. Please confirm your decision.",
        "fallback": "Please respond with yes or no if you wish to exit this session."
    },
    "greeting": {
        "keywords": [],
        "action": "Hello, I'm here to assist you in finding the right microcontroller for your specific application. To get started, simply say: \"Begin\" or something similar."
    },
    "recommendation": {
        "keywords": [],
        "action": "We've reviewed the data you provided. Please respond to receive the results."
    },
    "finish": {
        "keywords": [],
        "action": "You've completed your journey. For general information, visit the 'Info' screen, and for a detailed review of your results, check the 'Evaluation' screen. Thank you for using this tool!"
    }
}
