{

    "sophistication": {
        "question": "Would you consider yourself a novice, intermediate or advanced embedded developer?",
        "fallback": [
            "How would you classify your proficiency in embedded systems programming: novice, intermediate, or advanced?",
            "Please indicate your proficiency level in embedded development: novice, intermediate, or advanced.",
            "Are you familiar with embedded programming at a novice, intermediate, or advanced level?",
            "Please indicate whether your understanding of embedded programming is at a novice, intermediate, or advanced level.",
            "How experienced are you with embedded programming: novice, intermediate, or advanced?",
            "How would you classify your knowledge of embedded engineering: novice, intermediate, or advanced?",
            "Would you assess your understanding of embedded systems design as novice, intermediate, or advanced?",
            "Please characterize your knowledge of embedded programming: novice, intermediate, or advanced.",
            "What is your level of familiarity with embedded programming: novice, intermediate, or advanced?",
            "Are you familiar with embedded programming at a level: none, novice, intermediate, or advanced?"
        ],
        "result": {
            "novice": [
                "novice",
                "no ",
                "none",
                "dont",
                "n't",
                "never",
                "negative",
                "false"
            ],
            "intermediate": [
                "intermediate",
                "little",
                "existing",
                "bit",
                "some",
                "few",
                "small"
            ],
            "advanced": [
                "advanced",
                "enough",
                "suffic",
                "big",
                "much",
                "lot",
                "know",
                "detail",
                "all",
                "every",
                "comprehensive"
            ]
        }
    },
    "develprod": {
        "question": "For starters, are you looking to make a one-off prototype, or do you want something that'll scale to mass-production?",
        "fallback": [
            "It is sufficient when you say if you are making a prototype or not.",
            "Please let me know if you want to mass-produce this.",
            "You can simply mention if you're making only one or not.",
            "Just tell me if you are making more than ten.",
            "Are you planning to sell this as a product?",
            "Could you indicate whether you're planning to mass-produce this?",
            "Do you want to make multiple of your product?",
            "Are you developing a commercial product?"
        ],
        "result": {
            "devel": [
                "unique",
                "one",
                "prototype"
            ],
            "prod": [
                "mass",
                "commercial",
                "many",
                "product"
            ]
        }
    },
    "consumption": {
        "question": "How much power is your MCU allowed to consume?",
        "fallback": [
            "Please tell me what your power budget is!",
            "Tell me whether your MCU is allowed to consume little, medium, or a lot of power!"
        ],
        "result": {
            "low": [
                "little",
                "efficient",
                "low"
            ],
            "med": [
                "medium",
                "moderate",
                "normal"
            ],
            "high": [
                "all",
                "high",
                "unconstrained"
            ]
        }
    },
    "io": {
        "question": "Tell me: How many I/O pins do you need?",
        "fallback": [
            "How many I/O pins do you need? Fewer than 10 (few), a medium amount (up to 30), or a lot (up to 100)",
            "What are your I/O needs?"
        ],
        "result": {
            "few": [
                "little",
                "few",
                "low"
            ],
            "med": [
                "medium",
                "moderate",
                "normal"
            ],
            "lots": [
                "lots",
                "high",
                "plenty"
            ]
        }
    },
    "speed": {
        "question": "How much processing power does your application require?",
        "fallback": [
            "What are your needs when it comes to compute?",
            "How powerful will your MCU have to be?",
            "Are your flights primarily indoors or outdoors?",
            "Do you generally fly in indoor or outdoor environments?",
            "Let me know if you fly inside or outside most of the time.",
            "Are you flying indoors or outdoors during your sessions?",
            "Could you tell me if you're flying inside or outside?",
            "Are your flights conducted indoors or outdoors?",
            "Do you prefer flying indoors or outdoors?",
            "Could you indicate whether your flight area is indoors or outdoors?"
        ],
        "result": {
            "low": [
                "little",
                "few",
                "low"
            ],
            "med": [
                "medium",
                "moderate",
                "normal"
            ],
            "high": [
                "lots",
                "high",
                "plenty",
                "powerful"
            ]
        }
    },
    "size": {
        "question": "How much space is your MCU allowed to take up?",
        "fallback": [
            "How would you categorize your knowledge over your country's drone law, not existing, little, or big enough?",
            "Please specify your knowledge level about drone laws: none, little, or enough.",
            "Do you have no, little, or enough knowledge about the applicable drone laws?",
            "Let me know if your knowledge of drone laws is none, little, or enough.",
            "How familiar are you with drone laws: none, little, or enough?",
            "Would you say your knowledge of drone laws is nonexistent, little, or sufficient?",
            "Can you rate your understanding of drone laws as none, a little, or enough?",
            "Describe your knowledge of drone laws: none, some, or detailed.",
            "How much do you know about drone regulations: nothing, a little, or a lot?",
            "Do you have knowledge of drone laws: none at all, a bit, or comprehensive?"
        ],
        "result": {
            "low": [
                "little",
                "few",
                "low",
                "compact",
                "small",
                "little",
                "mini",
                "tiny"
            ],
            "med": [
                "medium",
                "moderate",
                "normal",
                "middle",
                "standard",
                "average",
                "typical",
                "general"
            ],
            "high": [
                "lots",
                "high",
                "plenty",
                "powerful",
                "big",
                "large"
            ]
        }
    },
    "budget": {
        "question": "What is your budget for this controller??",
        "fallback": [
            "Please provide your answer in EUR currency using a standard format.",
            "Can you please answer in EUR?",
            "Please tell me how much you're willing to spend in EUR.",
            "Can you let me know your budget in euros?"
        ],
        "result": false
    },
    "margin": {
        "question": "What is the additional margin you have? Don't worry, I won't ask again.",
        "fallback": [
            "Please provide your answer in EUR using a standard format, and ensure it is not zero."
        ],
        "result": false
    }
}
